package c2resource

import (
	"fmt"

	"github.com/BismarckDD/Caocao/c2common/c2enum"
)

// <60   -> D 1
// >= 60 -> C 2
// >= 70 -> B 3
// >= 80 -> A 4
// >= 90 -> S 5
// >= 100 -> X 6

// 兵种名称，兵种属性（攻击、精神、防御、敏捷、爆发），移动力，兵种能力（武力、智力、统帅、敏捷、运气）-
// 1级HP，1级MP，攻击力，精神力，防御力，敏捷，爆发力
var unitStatistics = [...][20]interface{}{
	{"群雄", "A", "A", "A", "A", "A", 5, 80, 80, 80, 80, 80, 100, ""},
	{"英雄", "A", "A", "A", "A", "A", ""},
	{"霸王", "A", "A", "A", "A", "A", ""},
	{"轻步兵", "", "", "", ""},
	{"重步兵", "", "", "", ""},
	{"近卫兵", "A", "B", "S", "B", "B"},
	{"轻骑兵", "S", "B", "A", "B", "B"},
	{"重骑兵", "", "", "", ""},
	{"亲卫队", "", "", "", ""},
	{"弓兵", "", "", "", ""},
	{"弩兵", "", "", "", ""},
	{"连弩兵", "", "", "", ""},
}

const ()

func test() {
	fmt.Printf("%d\n", c2enum.UNIT_END)
}
